'''
Beegeek
Напишите программу, определяющую:

количество строк, в которых bee встречается в качестве подстроки не менее двух раз
количество строк, в которых geek встречается в качестве слова хотя бы один раз
Формат входных данных
На вход программе произвольное количество строк, каждая из которых содержит набор произвольных символов.

Формат выходных данных
Программа должна вывести два числа:

первое — количество строк, в которых bee встречается в качестве подстроки не менее двух раз
второе — количество строк, в которых geek встречается в качестве слова хотя бы один раз
каждое на отдельной строке.

Примечание 1. Словом будем считать любую непрерывную последовательность из одного или нескольких символов, соответствующих \w.

Примечание 2. Строка может одновременно удовлетворять обоим условиям.

Примечание 3. В первой строке первого теста bee встречается в качестве подстроки 
3
3 раза:

beebee bee
Во второй строке bee встречается в качестве подстроки лишь один раз, а слово geek отсутствует.

В третьей строке bee встречается в качестве подстроки 
2
2 раза, geek в качестве слова — 
1
1 раз:

bee geek bee

'''

import re
import sys

bee=0
geek=0

for line in [txt.strip() for txt in sys.stdin]:
    bee += 1 if bool(re.search(r'(bee).{0,}\1',line)) else 0
    geek += 1 if bool(re.search(r'\b(?P<w1>geek)\b',line)) else 0
        
print(bee)
print(geek)