'''
Сотрудники организации 😔
Дан список сотрудников организации, в котором указаны их фамилии, имена и даты рождения. Напишите программу, которая определяет самого молодого сотрудника, празднующего свой день рождения в течение ближайших семи дней от текущей даты.

Формат входных данных
На вход программе в первой строке подается текущая дата в формате DD.MM.YYYY, в следующей строке вводится натуральное число 
�
n — количество сотрудников, работающих в организации. В последующих 
�
n строках вводятся данные о каждом сотруднике: имя, фамилия и дата рождения, разделённые пробелом. Дата рождения указывается в формате DD.MM.YYYY.

Формат выходных данных
Программа должна определить самого молодого сотрудника, празднующего свой день рождения в течение ближайших семи дней, и вывести его имя и фамилию, разделив пробелом. Если таких сотрудников нет, программа должна вывести текст:

Дни рождения не планируются
Примечание 1. Гарантируется, что у всех сотрудников даты рождения различны.

Примечание 2. Например, для даты 01.11.2021 ближайшими семью днями являются:

02.11.2021, 03.11.2021, 04.11.2021, 05.11.2021, 06.11.2021, 07.11.2021, 08.11.2021

'''


from datetime import datetime as dt
from datetime import timedelta as td

#curynce_date = dt.strptime(input(),'%d.%m.%Y')
curynce_date = dt.strptime('29.12.2021','%d.%m.%Y')
curynce_date = curynce_date.replace(year=2000)

num = int('4')

#list_org = [input() for _ in range(num)]
list_org = ['Иван Петров 30.12.1995','Петр Сергеев 04.01.1997','Сергей Романов 03.01.1994','Маша Иванова 31.12.1996']

dict_name = dict()

for line in list_org:
    name,last,date = line.split()
    date = dt.strptime(date,'%d.%m.%Y')
    date1 = date.replace(year=2000)
    count_days = abs((curynce_date-date1).days)
    print(count_days,name,last)
    if (count_days<=7 or count_days==360 or count_days==361)  and date1!=curynce_date:
        dict_name[date] = dict_name.get(date,[])
        dict_name[date].append(f'{name} {last}')

print(dict_name)
print(*dict_name.get(max(dict_name)))


