'''
В поисках слов 😇
Дана последовательность слов. Напишите программу, которая выводит наиболее часто встречаемое слово в этой последовательности.

Формат входных данных
На вход программе подается последовательность слов, разделенных пробелом.

Формат выходных данных
Программа должна определить наиболее часто встречаемое слово в введенной последовательности и вывести его в нижнем регистре.

Примечание 1. Гарантируется, что искомое слово единственное.

Примечание 2. Программа должна игнорировать регистр. То есть, например, слова Python и python считаются одинаковыми.

Примечание 3. Тестовые данные доступны по ссылкам:

Архив с тестами
GitHub
Sample Input 1:

Черешня Вишня Арбуз малина Малина клубникА Арбуз Банан вишня малина
Sample Output 1:

малина
Sample Input 2:

Арбуз Малина малина Арбуз клубника АрбуЗ Банан Малина вишня Черешня Вишня арбуз
Sample Output 2:

арбуз
Sample Input 3:

Клубника Малина Арбуз Малина Клубника Арбуз Банан Малина Клубника Вишня Клубника Черешня Вишня
Sample Output 3:

клубника
'''


from collections import Counter


print(list(Counter('Черешня Вишня Арбуз малина Малина клубникА Арбуз Банан вишня малина'.lower().split()).most_common(1))[0][0])